// ignore: unused_import
import 'package:flutter/foundation.dart';
// ignore: unused_import
import 'package:flutter/material.dart';
import 'package:my_applecitne/modle/trip.dart';
import "./modle/category.dart";

const Categories_data = const [
  category(
    id: 'c1',
    title: 'اهرامات الجيزة',
    imageUrl:
        'https://mf.b37mrtl.ru/media/pics/2018.12/article/5c0e821cd43750bb108b4596.jpg',
  ),
  category(
    id: 'c2',
    title: 'بحيرات',
    imageUrl:
        'https://images.unsplash.com/photo-1501785888041-af3ef285b470?ixid=MXwxMjA3fDB8MHxzZWFyY2h8NHx8bGFrZXxlbnwwfHwwfA%3D%3D&ixlib=rb-1.2.1&auto=format&fit=crop&w=400&q=60',
  ),
  category(
    id: 'c3',
    title: 'شواطىء',
    imageUrl:
        'https://images.unsplash.com/photo-1493558103817-58b2924bce98?ixid=MXwxMjA3fDB8MHxzZWFyY2h8MTAxfHxiZWFjaHxlbnwwfHwwfA%3D%3D&ixlib=rb-1.2.1&auto=format&fit=crop&w=400&q=60',
  ),
  category(
    id: 'c4',
    title: 'صحارى',
    imageUrl:
        'https://images.unsplash.com/photo-1473580044384-7ba9967e16a0?ixid=MXwxMjA3fDB8MHxzZWFyY2h8MXx8ZGVzZXJ0fGVufDB8fDB8&ixlib=rb-1.2.1&auto=format&fit=crop&w=400&q=60',
  ),
  category(
    id: 'c5',
    title: 'مدن تاريخية',
    imageUrl:
        'https://images.unsplash.com/photo-1467269204594-9661b134dd2b?ixid=MXwxMjA3fDB8MHxzZWFyY2h8NjR8fHRyYXZlbHxlbnwwfHwwfA%3D%3D&ixlib=rb-1.2.1&auto=format&fit=crop&w=400&q=60',
  ),
  category(
    id: 'c6',
    title: 'أخرى',
    imageUrl:
        'https://images.unsplash.com/photo-1605540436563-5bca919ae766?ixid=MXwxMjA3fDB8MHxzZWFyY2h8MXx8c2tpaW5nfGVufDB8fDB8&ixlib=rb-1.2.1&auto=format&fit=crop&w=400&q=60',
  ),
];

List<Trip> Trips_data = [
  Trip(
    id: 'm1',
    categories: [
      'c1',
    ],
    title: 'هرم خوفو',
    tripType: TripType.Exploration,
    season: Season.Winter,
    imageUrl:
        'https://vid.alarabiya.net/images/2017/11/02/3a0b2e4b-49cf-4a6a-819f-8c644dd05854/3a0b2e4b-49cf-4a6a-819f-8c644dd05854_16x9_1200x676.jpg',
    duration: 20,
    activities: [
      'زيارة المواقع الأثرية',
      'جولة سياحية على الأقدام',
      'زيارة المراكز التجارية للتبضع',
      'تناول وجبة الغداء',
      'استمتاع المناظر الجملية'
    ],
    program: [
      "معلومات هامة ومفيدة تفيد السياح عن هرم خوفو:",
      """
الهرم الأكبر أو هرم خوفو هو الأثر الوحيد الباقي من عجائب الدنيا السبع، ويقع بمنطقة أهرام الجيزة في مصر.
يعود بناء الهرم إلى نحو سنة 2560 قبل الميلاد حيث شيد كمقبرة لفرعون الأسرة الرابعة خوفو واستمر بناؤه لفترة 20 عامًا.
يبلغ ارتفاع الهرم الأصلي 146.5 متر، لكنه انحسر إلى 139 مترًا بسبب عوامل التعرية.
يتكون الهرم من 2.3 مليون كتلة حجرية، يبلغ متوسط وزن كل منها 2.5 طن.
تم بناء الهرم بدقة عالية، حيث يميل كل جانب من جوانبه بزاوية 51.85 درجة، وهو نفس الزاوية التي يميل بها المسار الذي يسلكه القمر حول الأرض.
يمكن للسياح زيارة الهرم الأكبر من خلال الحجز عبر أحد منظمي الرحلات السياحية في مصر.
""",
      "نصائح للسياح عند زيارة هرم خوفو:",
      """
يفضل ارتداء ملابس مريحة وحذاء مريح.
يفضل اصطحاب قبعة ونظارة شمسية.
يفضل شرب الكثير من الماء لتجنب الجفاف.
يفضل عدم إزعاج السياح الآخرين.
يفضل الالتزام بتعليمات الحراس.
""",
      "معلومات إضافية:",
      """
يمكن للسياح زيارة العديد من المعالم الأخرى في منطقة أهرام الجيزة، مثل هرم خفرع وهرم منقرع، ومعبد الوادي، ومعبد الجنائزي، وتمثال أبو الهول.
توجد العديد من المطاعم والمقاهي في منطقة أهرام الجيزة، حيث يمكن للسياح تناول الطعام والشراب والاستمتاع بالمناظر الخلابة.
""",
      "الخاتمة",
      """
يعد هرم خوفو أحد أهم المعالم السياحية في العالم، وهو تجربة لا تُنسى للسياح الذين يرغبون في استكشاف التاريخ والحضارة المصرية القديمة.
""",
    ],
    isInSummer: false,
    isForFamilies: true,
    isInWinter: true,
  ),
  Trip(
    id: 'm2',
    categories: [
      'c1',
    ],
    title: 'هرم خفرع',
    tripType: TripType.Exploration,
    season: Season.Winter,
    imageUrl:
        'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTsVT7BpOwusfdXug5k6DIW6-8tbsYvI__rAw&usqp=CAU',
    duration: 10,
    activities: [
      'زيارة المواقع الأثرية',
      'جولة سياحية على الأقدام',
      'زيارة المراكز التجارية للتبضع',
      'تناول وجبة الغداء',
      'استمتاع المناظر الجملية'
    ],
    program: [
      '''
هرم خفرع هو ثاني أكبر هرم في العالم، بعد هرم خوفو، ويقع في هضبة الجيزة في مصر. تم بناؤه من قبل الفرعون خفرع، ابن الفرعون خوفو، في القرن 26 قبل الميلاد.
فيما يلي بعض المعلومات الهامة والمفيدة التي تفيد السياح عن هرم خفرع''',
      '''ارتفاع الهرم: كان ارتفاع الهرم الأصلي 143 مترًا (469 قدمًا)، لكنه فقد حوالي 10 أمتار (33 قدمًا) من ارتفاعه بسبب التجوية. يبلغ ارتفاعه الحالي 136 مترًا (446 قدمًا).
الحجم: يبلغ حجم هرم خفرع حوالي 5 ملايين متر مكعب (1.3 مليون متر مكعب).
الزوايا: يبلغ ميل الهرم 53.10 درجة.
البناء: تم بناء الهرم من الحجر الجيري الأبيض من محاجر الجيزة. تم نقل الحجر الجيري بواسطة قنوات ومنحدرات إلى موقع الهرم.
الحجرة الداخلية: تحتوي الهرم على غرفتين دفن. غرفة الدفن الرئيسية تقع في قلب الهرم وهي مصنوعة من الجرانيت الأحمر. تحتوي الغرفة على تابوت فارغ.
المدخل: يقع المدخل الرئيسي للهرم على ارتفاع 15.2 متر (49 قدمًا) فوق مستوى سطح الأرض.
الزي الرسمي: يُطلب من الزوار ارتداء ملابس محتشمة عند زيارة هرم خفرع.
ساعات العمل: يفتح هرم خفرع للجمهور من الساعة 7 صباحًا إلى 5 مساءً.
رسوم الدخول: تبلغ رسوم الدخول إلى هرم خفرع 200 جنيه مصري للمصريين و500 جنيه مصري للأجانب.''',
      'فيما يلي بعض النصائح للزيارة:',
      '''احجز تذكرتك مسبقًا: يوصى بحجز تذكرتك مسبقًا لتجنب الازدحام.
أحضر الماء والطعام: لا توجد مرافق لتناول الطعام أو الشرب داخل الهرم.
ارتدِ أحذية مريحة: ستحتاج إلى المشي لمسافات طويلة داخل الهرم.
كن على دراية بالحرارة: يمكن أن تكون درجات الحرارة داخل الهرم مرتفعة جدًا.
يُعد هرم خفرع أحد أشهر المعالم السياحية في العالم. إنه مكان رائع لتعلم المزيد عن تاريخ مصر القديمة وحضارتها.

''',
    ],
    isInSummer: false,
    isForFamilies: false,
    isInWinter: false,
  ),
  Trip(
    id: 'm3',
    categories: [
      'c1',
    ],
    title: 'هرم منقرع',
    tripType: TripType.Recovery,
    season: Season.Winter,
    imageUrl:
        'https://cnn-arabic-images.cnn.io/cloudinary/image/upload/w_1920,h_1080,c_fill,q_auto,g_center/cnnarabic/2023/03/03/images/234429.jpg',
    duration: 45,
    activities: [
      'زيارة المواقع الأثرية',
      'جولة سياحية على الأقدام',
      'زيارة المراكز التجارية للتبضع',
      'تناول وجبة الغداء',
      'استمتاع المناظر الجملية'
    ],
    program: [
      "<إليك بعض المعلومات المهمة والمفيدة التي تفيد السياح عن هرم منقرع:>",
      'هرم منقرع هو أصغر الأهرامات الثلاثة الرئيسية في هضبة الجيزة في مصر، ويُعد أحد عجائب الدنيا السبع في العالم القديم. تم بناؤه من قبل الملك منقرع، وهو ابن الملك خفرع، في عهد الأسرة المصرية الرابعة.',
      '''أين يقع هرم منقرع؟ يقع هرم منقرع في هضبة الجيزة في مصر، بالقرب من هرم خوفو وهرم خفرع.
كم يبلغ ارتفاع هرم منقرع؟ يبلغ ارتفاع هرم منقرع 62 مترًا، وهو أصغر الأهرامات الثلاثة الرئيسية في هضبة الجيزة.
ما هي المواد التي تم استخدامها لبناء هرم منقرع؟ تم بناء هرم منقرع من الحجر الجيري من محاجر أسوان.
كم من الوقت استغرق بناء هرم منقرع؟ يُعتقد أن بناء هرم منقرع استغرق حوالي 20 عامًا.''',
      'فيما يلي بعض النصائح للسياح الذين يزورون هرم منقرع:',
      '''احضر ملابس مريحة وواسعة. ستحتاج إلى المشي لمسافات طويلة حول الهرم.
اشرب الكثير من الماء. يمكن أن يكون الجو حارًا في مصر.
استخدم واقيًا من الشمس. يمكن أن يكون ضوء الشمس قويًا في مصر.
كن على دراية بالحرارة الشديدة. يمكن أن يكون الجو حارًا في مصر، لذا كن على دراية بعلامات ضربة الشمس والإرهاق الحراري.
إليك بعض الأشياء التي يمكنك القيام بها في هرم منقرع:

قم بزيارة الهرم من الداخل. يمكنك شراء تذكرة لزيارة الهرم من الداخل.
قم بزيارة المتحف المصري. يقع المتحف المصري بالقرب من هرم منقرع، ويضم مجموعة رائعة من الآثار المصرية القديمة.
قم بزيارة هرم خوفو وهرم خفرع. هرم خوفو وهرم خفرع هما أكبر الأهرامات الثلاثة الرئيسية في هضبة الجيزة.
أتمنى أن تكون هذه المعلومات مفيدة.

''',
    ],
    isInSummer: false,
    isForFamilies: false,
    isInWinter: true,
  ),
  Trip(
    id: 'm4',
    categories: [
      'c1',
    ],
    title: ' مقبرة مر اس عنخ',
    tripType: TripType.Activities,
    season: Season.Spring,
    imageUrl:
        'https://egymonuments.gov.eg/media/5086/giza-180908-011-copia.jpg',
    duration: 60,
    activities: [
      'زيارة المواقع الأثرية',
      'جولة سياحية على الأقدام',
      'زيارة المراكز التجارية للتبضع',
      'تناول وجبة الغداء',
      'استمتاع المناظر الجملية'
    ],
    program: [
      'اليك بعض المعلومات التي قد تفيدك عن الملك مراس عنخ',
      '''تحت ظلال الهرم الأكبر تقع مقبرة الملكة مرس عنخ الثالثة، زوجة الملك خفرع  وحفيدة الملك العظيم خوفو. وتتميز تلك المقبرة بالحجم الكبير والزخارف الرائعة والتي تعكس مكانتها العظيمة، كما أنها تحتوي على أفضل مناظر محفوظة ضمن مقابر الجبانة الشرقية بهضبة الجيزة.  
وقد زينت جدران المقبرة بالعديد من المناظر المتنوعة، منها مناظر صناعة الخبز وتخمير البيرة وصناعة الحصير وصهر المعادن ونحت التماثيل ومناظر رعي وطيور، بالإضافة إلى مناظر تمثل الملكة نفسها، هذا إلى جانب مناظر بديعة لحاملات القرابين اللاتي تحملن مختلف العطايا للملكة والتي كان الغرض منها تحول تلك المناظر بطريقة سحرية إلى قرابين حقيقية تقدم لروحها بشكل مستمر في العالم الآخر. ومن ضمن الأشياء الرائعة التي تحملنها مظلة بها سرير يوضع أسفلها، وكرسي بذراعين ومحفة. وقد تم اكتشاف قطع حقيقية مماثلة لتلك الأثاثات داخل مقبرة الملكة حتب حرس الأولى أم الملك خوفو والمحفوظة حاليًا بالمتحف المصري بالتحرير. أما اللافت لنظر زائر المقبرة هو وجود عشر تماثيل كبيرة منحوتة على الجدار الشمالي لنسوة واقفات متجاورات، يعتقد أنها تمثل كل من مرس عنخ نفسها وأمها وبناتها. ''',
    ],
    isInSummer: false,
    isForFamilies: false,
    isInWinter: false,
  ),
  Trip(
    id: 'm5',
    categories: [
      'c1',
    ],
    title: 'هرم زوسر ',
    tripType: TripType.Activities,
    season: Season.Winter,
    imageUrl:
        'https://upload.wikimedia.org/wikipedia/commons/thumb/0/09/Saqqara_pyramid.jpg/600px-Saqqara_pyramid.jpg',
    duration: 15,
    activities: [
      'زيارة المواقع الأثرية',
      'جولة سياحية على الأقدام',
      'زيارة المراكز التجارية للتبضع',
      'تناول وجبة الغداء',
      'استمتاع المناظر الجملية'
    ],
    program: [
      'اليك بعض المعلومات الهامه التي قد تفيدك عن هرم زوسر',
      '''هرم زوسر أو هرم سقارة أو الهرم المدرج هو معلم آثري بجبانة سقارة شمال غرب مدينة ممفيس القديمة في مصر. بُني خلال القرن 27 ق.م لدفن الفرعون زوسر؛ بناه له وزيره إمحوتب. وكان المهندس والطبيب أمحتب هو المهندس الأساسي للمجموعة الجنائزية الواسعة في فناء الهرم وما يحيطه من هياكل الاحتفالية.

يتكون أول هرم مصري من ست مصاطب بُنيت فوق بعضها البعض، شيء يمثل تطوراً هائلاً في تصميم القبور في ذلك العهد الذي كان يكتفي بمصطبة واحدة. يبلغ ارتفاع هرم زوسر المدرج 62 متر (203 قدم) ، مع وجود قاعدة بمساحة 109 م × 125 م (358 قدم × 410 قدم)، وكان مُغطى بالحجر الجيرى الأبيض المصقول. يُعتبر الهرم المدرج أول بنية حجرية وقتها، على الرغم من أن الحوش المعروفة باسم جسر المدير يبدو أنه سبق بناء الهرم.

تأثر الهرم بزلزال وقع عام 1992 وأثر على بنية الهرم وأدى إلى سقوط أجزاء من مجموعة الجنائزية وكان اقدم هرم في التاريخ.

يعتبر موقع المدينة الجنائزية في سقارة جزءا من المواقع الجنائزية لمدينة منف موقعا للتراث العالمي منذ عام 1979 ''',
      'استكشافه العلمي',
      '''اكتشف مجمع هرم سقارة لأول مرة في عام 1821 حيث قام القنصل العام الألماني هينريش فون ميوتولي" وأيضا المهندس الإيطالي "غيرولانو سيجاتو" بفحصه، واكتشفا مدخله. وعثرا في ممراته الداخلية على بقايا مومياء عباره عن جمجمة مغطاة بالذهب وكعبي قدمين مغطاة أيضا بالذهب. واعتقد "فون مينوتولي" أنها تنتمي إلى مومياء زوسر. وحدث أن "فون مينوتولي" حصل بتفويض من القيصر الألماني وموافقة من محمد علي باشا حاكم مصر في ذلك الوقت على تصريح بأخذ تلك الآثار مع مجموعة آثار أخرى إلى ألمانيا. ولكن السفينة وتسمى سفينة جوتفريد غرقت بسبب إعصار شديد بالقرب من ميناء هامبورغ في ألمانيا، وضاعت تقريبا كل ما كان عليها من آثار (أنظر سفينة جوتفريد). وتبين فيما بعد أن ما وجده "فون مينوتولي في ممرات الهرم المدرج لم يكن إلا لمومياء أخرى وضعت في المقبرة في وقت لاحق بالعهد القديم.

وفي عام 1837 عثر الباحث جون بيرينغ على أثار مومياوات أخرى في الممرات، واكتشف أيضا حجرات وأبوهة تحت الهرم.

ثم قام «سيسيل فيرث» في عام 1926 باستكشافات مستفيضة، إلا أنه توفي قبل الانتهاء منها. فتولى «جيمس كيبل» رعاية الحفريات، لكن توفي أيضا في عام 1935 . وواصل «جين لاور» الذي كان يعمل تحت إدارة كيبل الاشراف على عمليات الحفريات، وقام بقياس الحجرات تحت الأرض والممرات المؤدية إليها. وفي عام 1934 كان قد عثر في حجرة المقبرة بقايا مومياء وأخذت إلى جامعة القاهرة بعد فحص ابتدائي وحفظت في الجامعة حتى عام 1988 . اعتقد «لاور» انه قد عثر على مومياء زوسر. ولكن بالفحص الدقيق الذي تم بعد ذلك تبين أنها من عدة موميات لأناس آخرين. وعين تاريخ تلك البقايا بواسطة طريقة الكربون-14 (تأريخ بالكربون المشع) واتضح انها لأناس من عهد البطالمة (أي أنها ليست من عهد زوسر نحو 2650 قبل الميلاد وإنما منذ نحو 200 سنة فقط قبل الميلاد).

واستمر لاور مكرساً حياته في استكشاف هرم زوسر والمدينة الجنائزية في سقارة حتى نهاية عمره في عام 2001 . وبمعاونة لاور فقد تمكن من استعادة تشكيل بعض أجزاء الجدار المحيط بفناء الهرم والمباني الأخرى التابعة.

وقد عثرت مجموعة من علماء الأثار من لتوانيا في عام 2001 على عدة أنفاق في مجمع الهرم، لم تكن معروفة من قبل.''',
    ],
    isInSummer: true,
    isForFamilies: false,
    isInWinter: true,
  ),
  Trip(
    id: 'm6',
    categories: [
      'c1',
    ],
    title: ' مقبره حتشبسوت',
    tripType: TripType.Exploration,
    season: Season.Summer,
    imageUrl:
        'https://upload.wikimedia.org/wikipedia/commons/thumb/c/c5/HatshepsutSarcophagus-ReinscribedForHerFather_MuseumOfFineArtsBoston.jpg/600px-HatshepsutSarcophagus-ReinscribedForHerFather_MuseumOfFineArtsBoston.jpg',
    duration: 240,
    activities: [
      'زيارة المواقع الأثرية',
      'جولة سياحية على الأقدام',
      'زيارة المراكز التجارية للتبضع',
      'تناول وجبة الغداء',
      'استمتاع المناظر الجملية'
    ],
    program: [
      'اليك بعض المعلومات الهامه التي قد تفيدك عن هرم زوسر',
      '''مقبرة 20 وتعرف عالميا باسم مقبرة KV20، وتقع في الوادي الشرقي بوادي الملوك بمصر، ويرجح أنها أولى المقابر الملكية التي بنيت في وادي الملوك وشيدت أساسا لتكون المثوى الأخير لفرعون مصر تحتمس الأول (والذي نقل فيما بعد إلى مقبرة 38) ثم استخدمت بعد ذلك لدفن الملكة حتشبسوت التي قامت بتوسعة المقبرة لتضم رفاتها ورفات والدها جنبا إلى جنب، وكان علماء الحملة الفرنسية على علم بوجود المقبرة عندما زاروا المنطقة عام 1799 وقاموا بتدوينها في سجلاتهم العلمية التي نشرت فيما بعد تحت اسم وصف مصر إلا أن دراسة المقبرة بشكل كامل لم يتم إلا على يد هوارد كارتر عام 1903 على الرغم من توافد العديد من المستكشفين عليها فيما بين 1799 و1903 . والمقبرة 20 تعد نموزجا فريدا بين مقابر وادي الملوك جميعها بسبب تصميمها الفريد وممراتها الدائرية لمسافة 210 أمتار تقريبا في أتجاه عقارب الساعة.''',
    ],
    isInSummer: true,
    isForFamilies: false,
    isInWinter: false,
  ),
  Trip(
    id: 'm7',
    categories: [
      'c3',
    ],
    title: 'شاطئ الأول',
    tripType: TripType.Exploration,
    season: Season.Winter,
    imageUrl: 'https://static.sayidaty.net/2022-07/134431.jpeg',
    duration: 20,
    activities: [
      'زيارة المواقع الأثرية',
      'جولة سياحية على الأقدام',
      'زيارة المراكز التجارية للتبضع',
      'تناول وجبة الغداء',
      'استمتاع المناظر الجملية'
    ],
    program: [
      'أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا.',
      'يسكينج أليايت سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا.',
      'لوريم ايبسوم دولار ات دولار ماجنا أليكيوا.',
      'لور دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا.',
    ],
    isInSummer: true,
    isForFamilies: false,
    isInWinter: false,
  ),
  Trip(
    id: 'm8',
    categories: [
      'c2',
    ],
    title: ' بحيرة كومو',
    tripType: TripType.Exploration,
    season: Season.Winter,
    imageUrl:
        'https://images.unsplash.com/photo-1493558103817-58b2924bce98?ixid=MXwxMjA3fDB8MHxzZWFyY2h8MTAxfHxiZWFjaHxlbnwwfHwwfA%3D%3D&ixlib=rb-1.2.1&auto=format&fit=crop&w=600&q=60',
    duration: 20,
    activities: [
      'زيارة المواقع الأثرية',
      'جولة سياحية على الأقدام',
      'زيارة المراكز التجارية للتبضع',
      'تناول وجبة الغداء',
      'استمتاع المناظر الجملية'
    ],
    program: [
      'أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا.',
      'يسكينج أليايت سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا.',
      'لوريم ايبسوم دولار ات دولار ماجنا أليكيوا.',
      'لور دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا.',
    ],
    isInSummer: true,
    isForFamilies: false,
    isInWinter: false,
  ),
  Trip(
    id: 'm9',
    categories: [
      'c3',
    ],
    title: 'الشاطىء الكبير',
    tripType: TripType.Recovery,
    season: Season.Spring,
    imageUrl:
        'https://images.unsplash.com/photo-1519046904884-53103b34b206?ixid=MXwxMjA3fDB8MHxzZWFyY2h8Mnx8YmVhY2h8ZW58MHx8MHw%3D&ixlib=rb-1.2.1&auto=format&fit=crop&w=500&q=60',
    duration: 35,
    activities: [
      'زيارة المواقع الأثرية',
      'جولة سياحية على الأقدام',
      'زيارة المراكز التجارية للتبضع',
      'تناول وجبة الغداء',
      'استمتاع المناظر الجملية'
    ],
    program: [
      'أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا.',
      'يسكينج أليايت سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا.',
      'لوريم ايبسوم دولار ات دولار ماجنا أليكيوا.',
      'لور دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا.',
    ],
    isInSummer: true,
    isForFamilies: false,
    isInWinter: true,
  ),
  Trip(
    id: 'm111',
    categories: [
      'c3',
    ],
    title: 'شاطىء الصخور',
    tripType: TripType.Exploration,
    season: Season.Summer,
    imageUrl:
        'https://images.unsplash.com/photo-1519602035691-16ac091344ef?ixid=MXwxMjA3fDB8MHxzZWFyY2h8MjE1fHxiZWFjaHxlbnwwfHwwfA%3D%3D&ixlib=rb-1.2.1&auto=format&fit=crop&w=600&q=60',
    duration: 45,
    activities: [
      'زيارة المواقع الأثرية',
      'جولة سياحية على الأقدام',
      'زيارة المراكز التجارية للتبضع',
      'تناول وجبة الغداء',
      'استمتاع المناظر الجملية'
    ],
    program: [
      'أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا.',
      'يسكينج أليايت سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا.',
      'لوريم ايبسوم دولار ات دولار ماجنا أليكيوا.',
      'لور دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا.',
    ],
    isInSummer: true,
    isForFamilies: false,
    isInWinter: false,
  ),
  Trip(
    id: 'm120',
    categories: [
      'c4',
    ],
    title: 'الصحراء الكبرى',
    tripType: TripType.Activities,
    season: Season.Winter,
    imageUrl:
        'https://images.unsplash.com/photo-1473580044384-7ba9967e16a0?ixid=MXwxMjA3fDB8MHxzZWFyY2h8MXx8ZGVzZXJ0fGVufDB8fDB8&ixlib=rb-1.2.1&auto=format&fit=crop&w=500&q=60',
    duration: 30,
    activities: [
      'زيارة المواقع الأثرية',
      'جولة سياحية على الأقدام',
      'زيارة المراكز التجارية للتبضع',
      'تناول وجبة الغداء',
      'استمتاع المناظر الجملية'
    ],
    program: [
      'أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا.',
      'يسكينج أليايت سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا.',
      'لوريم ايبسوم دولار ات دولار ماجنا أليكيوا.',
      'لور دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا.',
    ],
    isInSummer: true,
    isForFamilies: true,
    isInWinter: true,
  ),
  Trip(
    id: 'm411',
    categories: [
      'c4',
    ],
    title: 'الصحراء الغربية',
    tripType: TripType.Activities,
    season: Season.Winter,
    imageUrl:
        'https://images.unsplash.com/photo-1469854523086-cc02fe5d8800?ixid=MXwxMjA3fDB8MHxzZWFyY2h8MTB8fHRyYXZlbHxlbnwwfHwwfA%3D%3D&ixlib=rb-1.2.1&auto=format&fit=crop&w=600&q=60',
    duration: 30,
    activities: [
      'زيارة المواقع الأثرية',
      'جولة سياحية على الأقدام',
      'زيارة المراكز التجارية للتبضع',
      'تناول وجبة الغداء',
      'استمتاع المناظر الجملية'
    ],
    program: [
      'أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا.',
      'يسكينج أليايت سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا.',
      'لوريم ايبسوم دولار ات دولار ماجنا أليكيوا.',
      'لور دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا.',
    ],
    isInSummer: true,
    isForFamilies: true,
    isInWinter: true,
  ),
  Trip(
    id: 'm121',
    categories: [
      'c4',
    ],
    title: 'الصحراء الرملية',
    tripType: TripType.Activities,
    season: Season.Winter,
    imageUrl:
        'https://images.unsplash.com/photo-1452022582947-b521d8779ab6?ixid=MXwxMjA3fDB8MHxzZWFyY2h8ODN8fGRlc2VydHxlbnwwfHwwfA%3D%3D&ixlib=rb-1.2.1&auto=format&fit=crop&w=600&q=60',
    duration: 30,
    activities: [
      'زيارة المواقع الأثرية',
      'جولة سياحية على الأقدام',
      'زيارة المراكز التجارية للتبضع',
      'تناول وجبة الغداء',
      'استمتاع المناظر الجملية'
    ],
    program: [
      'أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا.',
      'يسكينج أليايت سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا.',
      'لوريم ايبسوم دولار ات دولار ماجنا أليكيوا.',
      'لور دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا.',
    ],
    isInSummer: true,
    isForFamilies: true,
    isInWinter: true,
  ),
  Trip(
    id: 'm133',
    categories: [
      'c5',
    ],
    title: 'المدينة الأولى',
    tripType: TripType.Activities,
    season: Season.Winter,
    imageUrl:
        'https://images.unsplash.com/photo-1498307833015-e7b400441eb8?ixid=MXwxMjA3fDB8MHxzZWFyY2h8NDJ8fHRyYXZlbHxlbnwwfHwwfA%3D%3D&ixlib=rb-1.2.1&auto=format&fit=crop&w=600&q=60',
    duration: 30,
    activities: [
      'زيارة المواقع الأثرية',
      'جولة سياحية على الأقدام',
      'زيارة المراكز التجارية للتبضع',
      'تناول وجبة الغداء',
      'استمتاع المناظر الجملية'
    ],
    program: [
      'أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا.',
      'يسكينج أليايت سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا.',
      'لوريم ايبسوم دولار ات دولار ماجنا أليكيوا.',
      'لور دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا.',
    ],
    isInSummer: true,
    isForFamilies: true,
    isInWinter: true,
  ),
  Trip(
    id: 'm14',
    categories: [
      'c5',
    ],
    title: 'المدينة الثانية',
    tripType: TripType.Activities,
    season: Season.Winter,
    imageUrl:
        'https://images.unsplash.com/photo-1467269204594-9661b134dd2b?ixid=MXwxMjA3fDB8MHxzZWFyY2h8NjR8fHRyYXZlbHxlbnwwfHwwfA%3D%3D&ixlib=rb-1.2.1&auto=format&fit=crop&w=600&q=60',
    duration: 30,
    activities: [
      'زيارة المواقع الأثرية',
      'جولة سياحية على الأقدام',
      'زيارة المراكز التجارية للتبضع',
      'تناول وجبة الغداء',
      'استمتاع المناظر الجملية'
    ],
    program: [
      'أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا.',
      'يسكينج أليايت سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا.',
      'لوريم ايبسوم دولار ات دولار ماجنا أليكيوا.',
      'لور دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا.',
    ],
    isInSummer: true,
    isForFamilies: true,
    isInWinter: true,
  ),
  Trip(
    id: 'm15',
    categories: [
      'c5',
    ],
    title: 'المدينة القديمة',
    tripType: TripType.Activities,
    season: Season.Winter,
    imageUrl:
        'https://images.unsplash.com/photo-1519923041107-e4dc8d9193da?ixid=MXwxMjA3fDB8MHxzZWFyY2h8Njd8fG9sZCUyMGNpdHl8ZW58MHx8MHw%3D&ixlib=rb-1.2.1&auto=format&fit=crop&w=600&q=60',
    duration: 30,
    activities: [
      'زيارة المواقع الأثرية',
      'جولة سياحية على الأقدام',
      'زيارة المراكز التجارية للتبضع',
      'تناول وجبة الغداء',
      'استمتاع المناظر الجملية'
    ],
    program: [
      'أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا.',
      'يسكينج أليايت سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا.',
      'لوريم ايبسوم دولار ات دولار ماجنا أليكيوا.',
      'لور دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا.',
    ],
    isInSummer: true,
    isForFamilies: true,
    isInWinter: true,
  ),
  Trip(
    id: 'm16',
    categories: [
      'c6',
    ],
    title: 'رياضة التثلج',
    tripType: TripType.Activities,
    season: Season.Winter,
    imageUrl:
        'https://images.unsplash.com/photo-1605540436563-5bca919ae766?ixid=MXwxMjA3fDB8MHxzZWFyY2h8MXx8c2tpaW5nfGVufDB8fDB8&ixlib=rb-1.2.1&auto=format&fit=crop&w=600&q=60',
    duration: 30,
    activities: [
      'زيارة المواقع الأثرية',
      'جولة سياحية على الأقدام',
      'زيارة المراكز التجارية للتبضع',
      'تناول وجبة الغداء',
      'استمتاع المناظر الجملية'
    ],
    program: [
      'أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا.',
      'يسكينج أليايت سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا.',
      'لوريم ايبسوم دولار ات دولار ماجنا أليكيوا.',
      'لور دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا.',
    ],
    isInSummer: true,
    isForFamilies: true,
    isInWinter: true,
  ),
  Trip(
    id: 'm17',
    categories: [
      'c6',
      'c2',
    ],
    title: 'القفز المظلي',
    tripType: TripType.Activities,
    season: Season.Winter,
    imageUrl:
        'https://images.unsplash.com/photo-1601024445121-e5b82f020549?ixid=MXwxMjA3fDB8MHxzZWFyY2h8MTJ8fHBhcmFjaHV0ZSUyMGp1bXBpbmd8ZW58MHx8MHw%3D&ixlib=rb-1.2.1&auto=format&fit=crop&w=600&q=60',
    duration: 30,
    activities: [
      'زيارة المواقع الأثرية',
      'جولة سياحية على الأقدام',
      'زيارة المراكز التجارية للتبضع',
      'تناول وجبة الغداء',
      'استمتاع المناظر الجملية'
    ],
    program: [
      'أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا.',
      'يسكينج أليايت سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا.',
      'لوريم ايبسوم دولار ات دولار ماجنا أليكيوا.',
      'لور دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا.',
    ],
    isInSummer: true,
    isForFamilies: true,
    isInWinter: true,
  ),
];
